Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/justice/civil_law/peace_commissioners.html.txt.tmx
Source language: en
Languages: ga

source: A Peace Commissioner is an honorary appointment made in Ireland by the Minister for Justice and Equality
ga: Ceapachán oinigh a dhéanann an tAire Dlí agus Cirt agus Comhionannais le duine a cheapadh ina C(h)oimisinéir Síochána

source: The powers and duties of Peace Commissioners consist primarily of:
ga: I measc na mbunchumhachtaí agus na ndualgas atá ag Coimisinéirí Síochána tá:

source: • Witnessing signatures on documents of required by various authorities
ga: • Bheith mar fhinné nuair a shínítear cáipéisí nuair is gá d'údaráis éagsúla

source: • Signing certificates and orders under various Acts
ga: • Teastais agus orduithe a shíniú faoi Achtanna éagsúla

source: The Courts of Justice Act 1924 gives Peace Commissioners the power to issue summons and warrants
ga: An tAcht Cúirteanna Breithiúnais 1924 tugann Coimisinéirí Síochána an chumhacht a eisiúint toghairme agus barántais

source: These powers are less frequently used these days
ga: Tá na cumhachtaí níos lú a úsáidtear go minic na laethanta seo

source: For example, applications for search warrants are normally made to the local District Court
ga: Mar shampla, iarratais ar bharántais chuardaigh a dhéantar de ghnáth chun na Cúirte Dúiche áitiúil

source: The Department of Justice and Equality maintains the Roll of Peace Commissioners, however, it may not be up to date
ga: Coinníonn an Roinn Dlí agus Cirt agus Comhionannais Rolla na gCoimisinéirí Síochána, áfach, ní fhéadfadh sé a bheith suas chun dáta

source: The Department will usually provide the name and address of a Peace Commissioner on request
ga: Soláthróidh an Roinn de ghnáth ar an ainm agus seoladh an Coimisinéir Síochána ar iarratas

source: Your local Garda (police) station may be able to give you the name and address of a Peace Commissioner
ga: Ba chóir do áitiúil an Gharda Síochána (na póilíní) stáisiún a bheith in ann a thabhairt duit an t-ainm agus seoladh an Coimisinéir Síochána

source: The Gardaí use their services in the course of their duties and should be in a position to supply the name and address of one who is active in your area
ga: Na Gardaí úsáid a bhaint as a gcuid seirbhísí i gcúrsa a gcuid dualgas agus ba chóir a bheith in ann a sholáthar ar an ainm agus seoladh an duine atá gníomhach i do cheantar

source: Contact information for all Garda stations in Ireland is available here
ga: Eolas teagmhála do gach stáisiún Garda in Éirinn ar fáil anseo

source: There are no qualifying examinations or educational standards required to be appointed as a Peace Commissioner but you are required to be a person of good character
ga: Ní gá aon scrúdú a thógáil nó cáilíochtaí oideachais a bheith bainte amach ag duine le bheith ceapaithe mar Choimisinéir Síochána ach ní mór do charachtar an duine a bheith go maith

source: Anyone who has been charged with or convicted of a serious offence will not be considered for appointment
ga: Ní bhreathnófar ar dhuine atá cúisithe nó cionntaithe as coir throm le ceapachán

source: Most Peace Commissioners are well established in their local community
ga: Tá an chuid is mó Coimisinéirí Síochána aitheanta go maith ina bpobal féin

source: Those being considered for appointment as a Peace Commissioner should be aware that the Minister for Justice reserves the right to verify with the Gardai that you have never been charged or convicted of a serious offence
ga: Ba cheart go dtuigfeadh aon duine atá faoi scrúdú le ceapachán mar Choimisinéir Síochána go bhfuil sé de cheart ag an Aire Dlí dul i gcomhairle leis na Gardaí le cinntiú nár chúisíodh nó nár chionntaíodh é/í as aon choir throm

source: If you are already serving as a Peace Commissioner and are subsequently convicted for a serious offence, your appointment as a Peace Commissioner will cease immediately
ga: Más Coimisinéir Síochána tú agus má chionntaítear tú as coir throm tiocfaidh deireadh láithreach le do cheapachán mar Choimisinéir Síochána

source: Civil servants are usually only appointed as Peace Commissioners where the performance of their official duties requires this
ga: Ní cheaptar státseirbhísigh ina gCoimisinéirí Síochána go hiondúil ach amháin nuair is gá é seo lena ndualgais oifigiúla a chur i gcrích

source: Solicitors and persons employed in their offices and members of the clergy are, as a matter of practice, not appointed as Peace Commissioners because of the possibility of a conflict of interest
ga: Is iondúil nach gceaptar dlíodóirí agus daoine atá fostaithe ina n-oifigí agus baill den chléir ina gCoimisinéirí Síochána ar fhaitíos go mbeadh coimhlint leasa ann

source: It is important to note that appointment as Peace Commissioner is entirely at the discretion of the Minister for Justice, having regard to the needs in your area
ga: Baineann an cinneadh Coimisinéir Síochána a cheapadh go hiomlán leis an Aire Dlí ag brath ar riachtanais i do cheantar

source: Your suitability for appointment or your standing in the local community does not confer any automatic entitlement to be appointed as a Peace Commissioner
ga: Fiú má bhíonn duine feiliúnach le ceapadh nó má bhíonn duine aitheanta sa phobal áitiúil ní gá go mbeadh sí/sé ceapaithe mar Choimisinéir Síochána

source: Peace Commissioners are honorary appointments and there is no remuneration or financial compensation by way of fees or expenses for their services
ga: Ceapacháin oinigh atá i gceapacháin mar Choimisinéirí Síochána agus níl aon thuarastail ná cúiteamh airgeadais le fáil i bhfoirm táillí ná costas as a gcuid seirbhísí a chur ar fáil

source: You may apply to be appointed as a Peace Commissioner on your own behalf, or you may be nominated by another person or you can nominate someone you feel would be suitable for this position
ga: Is féidir iarratas a dhéanamh le bheith ceapaithe tú féin mar Choimisinéir Síochána nó is féidir le duine eile tú a ainmniú nó is féidir leat féin duine a cheapann tú a bheith feiliúnach don phost seo a ainmniú

source: The application for appointment must be in writing and should include some information about the nominee and the reasons why you or they may be suitable for appointment. Where To Apply Send your personal application (or your nomination) in writing to: Minister for Justice and Equality Office of the Minister for Justice and Equality 94 St
ga: Ní mór don iarratas ar cheapachán a bheith i scríbhinn agus ba cheart go mbeadh eolas maidir leis an té atá ainmnithe ann chomh maith leis na fáthanna atá agat go bhfuil an duine sin nó thú féin feiliúnach don cheapachán
